gitmac56/Git_IR_REMO/PSoC/4244PVA-442.cydsn/Generated_Source/PSoC4/UART1_SPI_UART.h
/***************************************************************************//**
* \file UART1_SPI_UART.h
* \version 4.0
*
* \brief
*  This file provides constants and parameter values for the SCB Component in
*  SPI and UART modes.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2013-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_SPI_UART_UART1_H)
#define CY_SCB_SPI_UART_UART1_H

#include "UART1.h"


/***************************************
*   SPI Initial Parameter Constants
****************************************/

#define UART1_SPI_MODE                   (0u)
#define UART1_SPI_SUB_MODE               (0u)
#define UART1_SPI_CLOCK_MODE             (0u)
#define UART1_SPI_OVS_FACTOR             (16u)
#define UART1_SPI_MEDIAN_FILTER_ENABLE   (0u)
#define UART1_SPI_LATE_MISO_SAMPLE_ENABLE (0u)
#define UART1_SPI_RX_DATA_BITS_NUM       (8u)
#define UART1_SPI_TX_DATA_BITS_NUM       (8u)
#define UART1_SPI_WAKE_ENABLE            (0u)
#define UART1_SPI_BITS_ORDER             (1u)
#define UART1_SPI_TRANSFER_SEPARATION    (1u)
#define UART1_SPI_NUMBER_OF_SS_LINES     (1u)
#define UART1_SPI_RX_BUFFER_SIZE         (8u)
#define UART1_SPI_TX_BUFFER_SIZE         (8u)

#define UART1_SPI_INTERRUPT_MODE         (0u)

#define UART1_SPI_INTR_RX_MASK           (0x0u)
#define UART1_SPI_INTR_TX_MASK           (0x0u)

#define UART1_SPI_RX_TRIGGER_LEVEL       (7u)
#define UART1_SPI_TX_TRIGGER_LEVEL       (0u)

#define UART1_SPI_BYTE_MODE_ENABLE       (0u)
#define UART1_SPI_FREE_RUN_SCLK_ENABLE   (0u)
#define UART1_SPI_SS0_POLARITY           (0u)
#define UART1_SPI_SS1_POLARITY           (0u)
#define UART1_SPI_SS2_POLARITY           (0u)
#define UART1_SPI_SS3_POLARITY           (0u)


/***************************************
*   UART Initial Parameter Constants
****************************************/

#define UART1_UART_SUB_MODE              (0u)
#define UART1_UART_DIRECTION             (3u)
#define UART1_UART_DATA_BITS_NUM         (8u)
#define UART1_UART_PARITY_TYPE           (2u)
#define UART1_UART_STOP_BITS_NUM         (4u)
#define UART1_UART_OVS_FACTOR            (10u)
#define UART1_UART_IRDA_LOW_POWER        (0u)
#define UART1_UART_MEDIAN_FILTER_ENABLE  (0u)
#define UART1_UART_RETRY_ON_NACK         (0u)
#define UART1_UART_IRDA_POLARITY         (0u)
#define UART1_UART_DROP_ON_FRAME_ERR     (0u)
#define UART1_UART_DROP_ON_PARITY_ERR    (0u)
#define UART1_UART_WAKE_ENABLE           (0u)
#define UART1_UART_RX_BUFFER_SIZE        (8u)
#define UART1_UART_TX_BUFFER_SIZE        (8u)
#define UART1_UART_MP_MODE_ENABLE        (0u)
#define UART1_UART_MP_ACCEPT_ADDRESS     (0u)
#define UART1_UART_MP_RX_ADDRESS         (0x2u)
#define UART1_UART_MP_RX_ADDRESS_MASK    (0xFFu)

#define UART1_UART_INTERRUPT_MODE        (0u)

#define UART1_UART_INTR_RX_MASK          (0x0u)
#define UART1_UART_INTR_TX_MASK          (0x0u)

#define UART1_UART_RX_TRIGGER_LEVEL      (7u)
#define UART1_UART_TX_TRIGGER_LEVEL      (0u)

#define UART1_UART_BYTE_MODE_ENABLE      (0u)
#define UART1_UART_CTS_ENABLE            (0u)
#define UART1_UART_CTS_POLARITY          (0u)
#define UART1_UART_RTS_ENABLE            (0u)
#define UART1_UART_RTS_POLARITY          (0u)
#define UART1_UART_RTS_FIFO_LEVEL        (4u)

#define UART1_UART_RX_BREAK_WIDTH        (11u)

/* SPI mode enum */
#define UART1_SPI_SLAVE  (0u)
#define UART1_SPI_MASTER (1u)

/* UART direction enum */
#define UART1_UART_RX    (1u)
#define UART1_UART_TX    (2u)
#define UART1_UART_TX_RX (3u)


/***************************************
*   Conditional Compilation Parameters
****************************************/

#if(UART1_SCB_MODE_UNCONFIG_CONST_CFG)

    /* Mode */
    #define UART1_SPI_SLAVE_CONST        (1u)
    #define UART1_SPI_MASTER_CONST       (1u)

    /* Direction */
    #define UART1_RX_DIRECTION           (1u)
    #define UART1_TX_DIRECTION           (1u)
    #define UART1_UART_RX_DIRECTION      (1u)
    #define UART1_UART_TX_DIRECTION      (1u)

    /* Only external RX and TX buffer for Uncofigured mode */
    #define UART1_INTERNAL_RX_SW_BUFFER   (0u)
    #define UART1_INTERNAL_TX_SW_BUFFER   (0u)

    /* Get RX and TX buffer size */
    #define UART1_INTERNAL_RX_BUFFER_SIZE    (UART1_rxBufferSize + 1u)
    #define UART1_RX_BUFFER_SIZE             (UART1_rxBufferSize)
    #define UART1_TX_BUFFER_SIZE             (UART1_txBufferSize)

    /* Return true if buffer is provided */
    #define UART1_CHECK_RX_SW_BUFFER (NULL != UART1_rxBuffer)
    #define UART1_CHECK_TX_SW_BUFFER (NULL != UART1_txBuffer)

    /* Always provide global variables to support RX and TX buffers */
    #define UART1_INTERNAL_RX_SW_BUFFER_CONST    (1u)
    #define UART1_INTERNAL_TX_SW_BUFFER_CONST    (1u)

    /* Get wakeup enable option */
    #define UART1_SPI_WAKE_ENABLE_CONST  (1u)
    #define UART1_UART_WAKE_ENABLE_CONST (1u)
    #define UART1_CHECK_SPI_WAKE_ENABLE  ((0u != UART1_scbEnableWake) && UART1_SCB_MODE_SPI_RUNTM_CFG)
    #define UART1_CHECK_UART_WAKE_ENABLE ((0u != UART1_scbEnableWake) && UART1_SCB_MODE_UART_RUNTM_CFG)

    /* SPI/UART: TX or RX FIFO size */
    #if (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
        #define UART1_SPI_UART_FIFO_SIZE             (UART1_FIFO_SIZE)
        #define UART1_CHECK_UART_RTS_CONTROL_FLOW    (0u)
    #else
        #define UART1_SPI_UART_FIFO_SIZE (UART1_GET_FIFO_SIZE(UART1_CTRL_REG & \
                                                                                    UART1_CTRL_BYTE_MODE))

        #define UART1_CHECK_UART_RTS_CONTROL_FLOW \
                    ((UART1_SCB_MODE_UART_RUNTM_CFG) && \
                     (0u != UART1_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(UART1_UART_FLOW_CTRL_REG)))
    #endif /* (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

#else

