gitmac56/Git_IR_REMO/PSoC/4244PVA-442.cydsn/Generated_Source/PSoC4/UART1_SPI_UART.h
    /** When enabled the TX and RX FIFO depth is doubled and equal to
     *  16 bytes: 0 – disable, 1 – enable. This implies that number of
     *  Data bits must be less than or equal to 8.
     *
     *  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /
     *  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *  PSoC Analog Coprocessor.
    */
    uint8 enableByteMode;

    /** Enables usage of CTS input signal by the UART transmitter : 0 – disable,
     *  1 – enable.
     *
     *  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /
     *  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *  PSoC Analog Coprocessor.
    */
    uint8 enableCts;

    /** Sets active polarity of CTS input signal:
     *  - UART1_UART_CTS_ACTIVE_LOW
     *  - UART1_UART_CTS_ACTIVE_HIGH
     *
     *  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /
     *  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *  PSoC Analog Coprocessor.
    */
    uint8 ctsPolarity;

    /** RX FIFO level for RTS signal activation. While the RX FIFO has fewer
     *  entries than the RTS FIFO level value the RTS signal remains active,
     *  otherwise the RTS signal becomes inactive. By setting this field to 0,
     *  RTS signal activation is disabled.
     *
     *  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /
     *  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *  PSoC Analog Coprocessor.
    */
    uint8 rtsRxFifoLevel;

    /** Sets active polarity of RTS output signal:
     *  - UART1_UART_RTS_ ACTIVE_LOW
     *  - UART1_UART_RTS_ACTIVE_HIGH
     *
     *  Ignored for all devices other than PSoC 4100 BLE / PSoC 4200 BLE /
     *  PSoC 4100M / PSoC 4200M / PSoC 4200L / PSoC 4000S / PSoC 4100S /
     *  PSoC Analog Coprocessor.
    */
    uint8 rtsPolarity;

    /** Configures the width of a break signal in that triggers the break
     *  detection interrupt source. A Break is a low level on the RX line.
     *  Valid range is 1-16 UART bits times.
    */
    uint8 breakWidth;
} UART1_UART_INIT_STRUCT;

/** @} structures */


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_spi
* @{
*/
/* SPI specific functions */
#if(UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    void UART1_SpiInit(const UART1_SPI_INIT_STRUCT *config);
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */


#if(UART1_SCB_MODE_SPI_INC)
    /*******************************************************************************
    * Function Name: UART1_SpiIsBusBusy
    ****************************************************************************//**
    *
    *  Returns the current status on the bus. The bus status is determined using
    *  the slave select signal.
    *  - Motorola and National Semiconductor sub-modes: The bus is busy after
    *    the slave select line is activated and lasts until the slave select line
    *    is deactivated.
    *  - Texas Instrument sub-modes: The bus is busy at the moment of the initial
    *    pulse on the slave select line and lasts until the transfer is complete.
    *    If SPI Master is configured to use "Separated transfers"
    *    (see Continuous versus Separated Transfer Separation), the bus is busy
    *    during each element transfer and is free between each element transfer.
    *    The Master does not activate SS line immediately after data has been
    *    written into the TX FIFO.
    *
    *  \return slaveSelect: Current status on the bus.
    *   If the returned value is nonzero, the bus is busy.
    *   If zero is returned, the bus is free. The bus status is determined using
    *   the slave select signal.
    *
    *******************************************************************************/
    #define UART1_SpiIsBusBusy() ((uint32) (0u != (UART1_SPI_STATUS_REG & \
                                                              UART1_SPI_STATUS_BUS_BUSY)))

    #if (UART1_SPI_MASTER_CONST)
        void UART1_SpiSetActiveSlaveSelect(uint32 slaveSelect);
    #endif /*(UART1_SPI_MASTER_CONST) */

    #if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
        void UART1_SpiSetSlaveSelectPolarity(uint32 slaveSelect, uint32 polarity);
    #endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
#endif /* (UART1_SCB_MODE_SPI_INC) */
/** @} spi */

/**
* \addtogroup group_uart
* @{
*/
/* UART specific functions */
#if(UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    void UART1_UartInit(const UART1_UART_INIT_STRUCT *config);
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */

#if(UART1_SCB_MODE_UART_INC)
    void UART1_UartSetRxAddress(uint32 address);
    void UART1_UartSetRxAddressMask(uint32 addressMask);


    /* UART RX direction APIs */
    #if(UART1_UART_RX_DIRECTION)
        uint32 UART1_UartGetChar(void);
        uint32 UART1_UartGetByte(void);

        #if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
            /* UART APIs for Flow Control */
            void UART1_UartSetRtsPolarity(uint32 polarity);
            void UART1_UartSetRtsFifoLevel(uint32 level);
        #endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
    #endif /* (UART1_UART_RX_DIRECTION) */

    /* UART TX direction APIs */
    #if(UART1_UART_TX_DIRECTION)
        /*******************************************************************************
        * Function Name: UART1_UartPutChar
        ****************************************************************************//**
        *
        *  Places a byte of data in the transmit buffer to be sent at the next available
        *  bus time. This function is blocking and waits until there is a space
        *  available to put requested data in the transmit buffer.
        *  For UART Multi Processor mode this function can send 9-bits data as well.
        *  Use UART1_UART_MP_MARK to add a mark to create an address byte.
        *
        *  \param txDataByte: the data to be transmitted.
        *
        *******************************************************************************/
        #define UART1_UartPutChar(ch)    UART1_SpiUartWriteTxData((uint32)(ch))

        void UART1_UartPutString(const char8 string[]);
        void UART1_UartPutCRLF(uint32 txDataByte);
        void UART1_UartSendBreakBlocking(uint32 breakWidth);

        #if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
            /* UART APIs for Flow Control */
            void UART1_UartEnableCts(void);
            void UART1_UartDisableCts(void);
            void UART1_UartSetCtsPolarity(uint32 polarity);
        #endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
    #endif /* (UART1_UART_TX_DIRECTION) */
#endif /* (UART1_SCB_MODE_UART_INC) */
/** @} uart */

/**
* \addtogroup group_spi_uart
* @{
*/
#if(UART1_RX_DIRECTION)
    uint32 UART1_SpiUartReadRxData(void);
    uint32 UART1_SpiUartGetRxBufferSize(void);
    void   UART1_SpiUartClearRxBuffer(void);
#endif /* (UART1_RX_DIRECTION) */

