gitmac56/Git_IR_REMO/PSoC/4244PVA-442.cydsn/Generated_Source/PSoC4/UART1_SPI_UART.h
/* Common APIs TX direction */
#if(UART1_TX_DIRECTION)
    void   UART1_SpiUartWriteTxData(uint32 txData);
    void   UART1_SpiUartPutArray(const uint8 wrBuf[], uint32 count);
    uint32 UART1_SpiUartGetTxBufferSize(void);
    void   UART1_SpiUartClearTxBuffer(void);
#endif /* (UART1_TX_DIRECTION) */
/** @} spi_uart */

CY_ISR_PROTO(UART1_SPI_UART_ISR);

#if(UART1_UART_RX_WAKEUP_IRQ)
    CY_ISR_PROTO(UART1_UART_WAKEUP_ISR);
#endif /* (UART1_UART_RX_WAKEUP_IRQ) */


/***************************************
*     Buffer Access Macro Definitions
***************************************/

#if(UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    /* RX direction */
    void   UART1_PutWordInRxBuffer  (uint32 idx, uint32 rxDataByte);
    uint32 UART1_GetWordFromRxBuffer(uint32 idx);

    /* TX direction */
    void   UART1_PutWordInTxBuffer  (uint32 idx, uint32 txDataByte);
    uint32 UART1_GetWordFromTxBuffer(uint32 idx);

#else
    /* RX direction */
    #if(UART1_INTERNAL_RX_SW_BUFFER_CONST)
        #define UART1_PutWordInRxBuffer(idx, rxDataByte) \
                do{                                                 \
                    UART1_rxBufferInternal[(idx)] = ((uint8) (rxDataByte)); \
                }while(0)

        #define UART1_GetWordFromRxBuffer(idx) UART1_rxBufferInternal[(idx)]

    #endif /* (UART1_INTERNAL_RX_SW_BUFFER_CONST) */

    /* TX direction */
    #if(UART1_INTERNAL_TX_SW_BUFFER_CONST)
        #define UART1_PutWordInTxBuffer(idx, txDataByte) \
                    do{                                             \
                        UART1_txBufferInternal[(idx)] = ((uint8) (txDataByte)); \
                    }while(0)

        #define UART1_GetWordFromTxBuffer(idx) UART1_txBufferInternal[(idx)]

    #endif /* (UART1_INTERNAL_TX_SW_BUFFER_CONST) */

#endif /* (UART1_TX_SW_BUFFER_ENABLE) */


/***************************************
*         SPI API Constants
***************************************/

/* SPI sub mode enum */
#define UART1_SPI_MODE_MOTOROLA      (0x00u)
#define UART1_SPI_MODE_TI_COINCIDES  (0x01u)
#define UART1_SPI_MODE_TI_PRECEDES   (0x11u)
#define UART1_SPI_MODE_NATIONAL      (0x02u)
#define UART1_SPI_MODE_MASK          (0x03u)
#define UART1_SPI_MODE_TI_PRECEDES_MASK  (0x10u)
#define UART1_SPI_MODE_NS_MICROWIRE  (UART1_SPI_MODE_NATIONAL)

/* SPI phase and polarity mode enum */
#define UART1_SPI_SCLK_CPHA0_CPOL0   (0x00u)
#define UART1_SPI_SCLK_CPHA0_CPOL1   (0x02u)
#define UART1_SPI_SCLK_CPHA1_CPOL0   (0x01u)
#define UART1_SPI_SCLK_CPHA1_CPOL1   (0x03u)

/* SPI bits order enum */
#define UART1_BITS_ORDER_LSB_FIRST   (0u)
#define UART1_BITS_ORDER_MSB_FIRST   (1u)

/* SPI transfer separation enum */
#define UART1_SPI_TRANSFER_SEPARATED     (0u)
#define UART1_SPI_TRANSFER_CONTINUOUS    (1u)

/* SPI slave select constants */
#define UART1_SPI_SLAVE_SELECT0    (UART1_SCB__SS0_POSISTION)
#define UART1_SPI_SLAVE_SELECT1    (UART1_SCB__SS1_POSISTION)
#define UART1_SPI_SLAVE_SELECT2    (UART1_SCB__SS2_POSISTION)
#define UART1_SPI_SLAVE_SELECT3    (UART1_SCB__SS3_POSISTION)

/* SPI slave select polarity settings */
#define UART1_SPI_SS_ACTIVE_LOW  (0u)
#define UART1_SPI_SS_ACTIVE_HIGH (1u)

#define UART1_INTR_SPIM_TX_RESTORE   (UART1_INTR_TX_OVERFLOW)

#define UART1_INTR_SPIS_TX_RESTORE     (UART1_INTR_TX_OVERFLOW | \
                                                 UART1_INTR_TX_UNDERFLOW)

/***************************************
*         UART API Constants
***************************************/

/* UART sub-modes enum */
#define UART1_UART_MODE_STD          (0u)
#define UART1_UART_MODE_SMARTCARD    (1u)
#define UART1_UART_MODE_IRDA         (2u)

/* UART direction enum */
#define UART1_UART_RX    (1u)
#define UART1_UART_TX    (2u)
#define UART1_UART_TX_RX (3u)

/* UART parity enum */
#define UART1_UART_PARITY_EVEN   (0u)
#define UART1_UART_PARITY_ODD    (1u)
#define UART1_UART_PARITY_NONE   (2u)

/* UART stop bits enum */
#define UART1_UART_STOP_BITS_1   (2u)
#define UART1_UART_STOP_BITS_1_5 (3u)
#define UART1_UART_STOP_BITS_2   (4u)

/* UART IrDA low power OVS enum */
#define UART1_UART_IRDA_LP_OVS16     (16u)
#define UART1_UART_IRDA_LP_OVS32     (32u)
#define UART1_UART_IRDA_LP_OVS48     (48u)
#define UART1_UART_IRDA_LP_OVS96     (96u)
#define UART1_UART_IRDA_LP_OVS192    (192u)
#define UART1_UART_IRDA_LP_OVS768    (768u)
#define UART1_UART_IRDA_LP_OVS1536   (1536u)

/* Uart MP: mark (address) and space (data) bit definitions */
#define UART1_UART_MP_MARK       (0x100u)
#define UART1_UART_MP_SPACE      (0x000u)

/* UART CTS/RTS polarity settings */
#define UART1_UART_CTS_ACTIVE_LOW    (0u)
#define UART1_UART_CTS_ACTIVE_HIGH   (1u)
#define UART1_UART_RTS_ACTIVE_LOW    (0u)
#define UART1_UART_RTS_ACTIVE_HIGH   (1u)

/* Sources of RX errors */
#define UART1_INTR_RX_ERR        (UART1_INTR_RX_OVERFLOW    | \
                                             UART1_INTR_RX_UNDERFLOW   | \
                                             UART1_INTR_RX_FRAME_ERROR | \
                                             UART1_INTR_RX_PARITY_ERROR)

/* Shifted INTR_RX_ERR defines ONLY for UART1_UartGetByte() */
#define UART1_UART_RX_OVERFLOW       (UART1_INTR_RX_OVERFLOW << 8u)
#define UART1_UART_RX_UNDERFLOW      (UART1_INTR_RX_UNDERFLOW << 8u)
#define UART1_UART_RX_FRAME_ERROR    (UART1_INTR_RX_FRAME_ERROR << 8u)
#define UART1_UART_RX_PARITY_ERROR   (UART1_INTR_RX_PARITY_ERROR << 8u)
#define UART1_UART_RX_ERROR_MASK     (UART1_UART_RX_OVERFLOW    | \
                                                 UART1_UART_RX_UNDERFLOW   | \
                                                 UART1_UART_RX_FRAME_ERROR | \
                                                 UART1_UART_RX_PARITY_ERROR)

#define UART1_INTR_UART_TX_RESTORE   (UART1_INTR_TX_OVERFLOW  | \
                                                 UART1_INTR_TX_UART_NACK | \
                                                 UART1_INTR_TX_UART_DONE | \
                                                 UART1_INTR_TX_UART_ARB_LOST)


/***************************************
*     Vars with External Linkage
***************************************/

#if(UART1_SCB_MODE_UNCONFIG_CONST_CFG)
    extern const UART1_SPI_INIT_STRUCT  UART1_configSpi;
    extern const UART1_UART_INIT_STRUCT UART1_configUart;
#endif /* (UART1_SCB_MODE_UNCONFIG_CONST_CFG) */

#if (UART1_UART_WAKE_ENABLE_CONST && UART1_UART_RX_WAKEUP_IRQ)
    extern uint8 UART1_skipStart;
#endif /* (UART1_UART_WAKE_ENABLE_CONST && UART1_UART_RX_WAKEUP_IRQ) */


