gitmac56/Git_IR_REMO/PSoC/4244PVA-442.cydsn/Generated_Source/PSoC4/UART1_SPI_UART.h
/***************************************
*    Specific SPI Macro Definitions
***************************************/

#define UART1_GET_SPI_INTR_SLAVE_MASK(sourceMask)  ((sourceMask) & UART1_INTR_SLAVE_SPI_BUS_ERROR)
#define UART1_GET_SPI_INTR_MASTER_MASK(sourceMask) ((sourceMask) & UART1_INTR_MASTER_SPI_DONE)
#define UART1_GET_SPI_INTR_RX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~UART1_INTR_SLAVE_SPI_BUS_ERROR)

#define UART1_GET_SPI_INTR_TX_MASK(sourceMask) \
                                             ((sourceMask) & (uint32) ~UART1_INTR_MASTER_SPI_DONE)


/***************************************
*    Specific UART Macro Definitions
***************************************/

#define UART1_UART_GET_CTRL_OVS_IRDA_LP(oversample) \
        ((UART1_UART_IRDA_LP_OVS16   == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS16 : \
         ((UART1_UART_IRDA_LP_OVS32   == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS32 : \
          ((UART1_UART_IRDA_LP_OVS48   == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS48 : \
           ((UART1_UART_IRDA_LP_OVS96   == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS96 : \
            ((UART1_UART_IRDA_LP_OVS192  == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS192 : \
             ((UART1_UART_IRDA_LP_OVS768  == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS768 : \
              ((UART1_UART_IRDA_LP_OVS1536 == (oversample)) ? UART1_CTRL_OVS_IRDA_LP_OVS1536 : \
                                                                          UART1_CTRL_OVS_IRDA_LP_OVS16)))))))

#define UART1_GET_UART_RX_CTRL_ENABLED(direction) ((0u != (UART1_UART_RX & (direction))) ? \
                                                                     (UART1_RX_CTRL_ENABLED) : (0u))

#define UART1_GET_UART_TX_CTRL_ENABLED(direction) ((0u != (UART1_UART_TX & (direction))) ? \
                                                                     (UART1_TX_CTRL_ENABLED) : (0u))


/***************************************
*        SPI Register Settings
***************************************/

#define UART1_CTRL_SPI      (UART1_CTRL_MODE_SPI)
#define UART1_SPI_RX_CTRL   (UART1_RX_CTRL_ENABLED)
#define UART1_SPI_TX_CTRL   (UART1_TX_CTRL_ENABLED)


/***************************************
*       SPI Init Register Settings
***************************************/

#define UART1_SPI_SS_POLARITY \
             (((uint32) UART1_SPI_SS0_POLARITY << UART1_SPI_SLAVE_SELECT0) | \
              ((uint32) UART1_SPI_SS1_POLARITY << UART1_SPI_SLAVE_SELECT1) | \
              ((uint32) UART1_SPI_SS2_POLARITY << UART1_SPI_SLAVE_SELECT2) | \
              ((uint32) UART1_SPI_SS3_POLARITY << UART1_SPI_SLAVE_SELECT3))

#if(UART1_SCB_MODE_SPI_CONST_CFG)

    /* SPI Configuration */
    #define UART1_SPI_DEFAULT_CTRL \
                    (UART1_GET_CTRL_OVS(UART1_SPI_OVS_FACTOR) | \
                     UART1_GET_CTRL_BYTE_MODE (UART1_SPI_BYTE_MODE_ENABLE) | \
                     UART1_GET_CTRL_EC_AM_MODE(UART1_SPI_WAKE_ENABLE)      | \
                     UART1_CTRL_SPI)

    #define UART1_SPI_DEFAULT_SPI_CTRL \
                    (UART1_GET_SPI_CTRL_CONTINUOUS    (UART1_SPI_TRANSFER_SEPARATION)       | \
                     UART1_GET_SPI_CTRL_SELECT_PRECEDE(UART1_SPI_SUB_MODE &                   \
                                                                  UART1_SPI_MODE_TI_PRECEDES_MASK)     | \
                     UART1_GET_SPI_CTRL_SCLK_MODE     (UART1_SPI_CLOCK_MODE)                | \
                     UART1_GET_SPI_CTRL_LATE_MISO_SAMPLE(UART1_SPI_LATE_MISO_SAMPLE_ENABLE) | \
                     UART1_GET_SPI_CTRL_SCLK_CONTINUOUS(UART1_SPI_FREE_RUN_SCLK_ENABLE)     | \
                     UART1_GET_SPI_CTRL_SSEL_POLARITY (UART1_SPI_SS_POLARITY)               | \
                     UART1_GET_SPI_CTRL_SUB_MODE      (UART1_SPI_SUB_MODE)                  | \
                     UART1_GET_SPI_CTRL_MASTER_MODE   (UART1_SPI_MODE))

    /* RX direction */
    #define UART1_SPI_DEFAULT_RX_CTRL \
                    (UART1_GET_RX_CTRL_DATA_WIDTH(UART1_SPI_RX_DATA_BITS_NUM)     | \
                     UART1_GET_RX_CTRL_BIT_ORDER (UART1_SPI_BITS_ORDER)           | \
                     UART1_GET_RX_CTRL_MEDIAN    (UART1_SPI_MEDIAN_FILTER_ENABLE) | \
                     UART1_SPI_RX_CTRL)

    #define UART1_SPI_DEFAULT_RX_FIFO_CTRL \
                    UART1_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(UART1_SPI_RX_TRIGGER_LEVEL)

    /* TX direction */
    #define UART1_SPI_DEFAULT_TX_CTRL \
                    (UART1_GET_TX_CTRL_DATA_WIDTH(UART1_SPI_TX_DATA_BITS_NUM) | \
                     UART1_GET_TX_CTRL_BIT_ORDER (UART1_SPI_BITS_ORDER)       | \
                     UART1_SPI_TX_CTRL)

    #define UART1_SPI_DEFAULT_TX_FIFO_CTRL \
                    UART1_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(UART1_SPI_TX_TRIGGER_LEVEL)

    /* Interrupt sources */
    #define UART1_SPI_DEFAULT_INTR_SPI_EC_MASK   (UART1_NO_INTR_SOURCES)

    #define UART1_SPI_DEFAULT_INTR_I2C_EC_MASK   (UART1_NO_INTR_SOURCES)
    #define UART1_SPI_DEFAULT_INTR_SLAVE_MASK \
                    (UART1_SPI_INTR_RX_MASK & UART1_INTR_SLAVE_SPI_BUS_ERROR)

    #define UART1_SPI_DEFAULT_INTR_MASTER_MASK \
                    (UART1_SPI_INTR_TX_MASK & UART1_INTR_MASTER_SPI_DONE)

    #define UART1_SPI_DEFAULT_INTR_RX_MASK \
                    (UART1_SPI_INTR_RX_MASK & (uint32) ~UART1_INTR_SLAVE_SPI_BUS_ERROR)

    #define UART1_SPI_DEFAULT_INTR_TX_MASK \
                    (UART1_SPI_INTR_TX_MASK & (uint32) ~UART1_INTR_MASTER_SPI_DONE)

#endif /* (UART1_SCB_MODE_SPI_CONST_CFG) */


/***************************************
*        UART Register Settings
***************************************/

#define UART1_CTRL_UART      (UART1_CTRL_MODE_UART)
#define UART1_UART_RX_CTRL   (UART1_RX_CTRL_LSB_FIRST) /* LSB for UART goes first */
#define UART1_UART_TX_CTRL   (UART1_TX_CTRL_LSB_FIRST) /* LSB for UART goes first */


/***************************************
*      UART Init Register Settings
***************************************/

#if(UART1_SCB_MODE_UART_CONST_CFG)

    /* UART configuration */
    #if(UART1_UART_MODE_IRDA == UART1_UART_SUB_MODE)

        #define UART1_DEFAULT_CTRL_OVS   ((0u != UART1_UART_IRDA_LOW_POWER) ?              \
                                (UART1_UART_GET_CTRL_OVS_IRDA_LP(UART1_UART_OVS_FACTOR)) : \
                                (UART1_CTRL_OVS_IRDA_OVS16))

    #else

