gitmac56/Git_IR_REMO/PSoC/4244PVA-442.cydsn/Generated_Source/PSoC4/UART1_SPI_UART.h
        #define UART1_DEFAULT_CTRL_OVS   UART1_GET_CTRL_OVS(UART1_UART_OVS_FACTOR)

    #endif /* (UART1_UART_MODE_IRDA == UART1_UART_SUB_MODE) */

    #define UART1_UART_DEFAULT_CTRL \
                                (UART1_GET_CTRL_BYTE_MODE  (UART1_UART_BYTE_MODE_ENABLE)  | \
                                 UART1_GET_CTRL_ADDR_ACCEPT(UART1_UART_MP_ACCEPT_ADDRESS) | \
                                 UART1_DEFAULT_CTRL_OVS                                              | \
                                 UART1_CTRL_UART)

    #define UART1_UART_DEFAULT_UART_CTRL \
                                    (UART1_GET_UART_CTRL_MODE(UART1_UART_SUB_MODE))

    /* RX direction */
    #define UART1_UART_DEFAULT_RX_CTRL_PARITY \
                                ((UART1_UART_PARITY_NONE != UART1_UART_PARITY_TYPE) ?      \
                                  (UART1_GET_UART_RX_CTRL_PARITY(UART1_UART_PARITY_TYPE) | \
                                   UART1_UART_RX_CTRL_PARITY_ENABLED) : (0u))

    #define UART1_UART_DEFAULT_UART_RX_CTRL \
                    (UART1_GET_UART_RX_CTRL_MODE(UART1_UART_STOP_BITS_NUM)                    | \
                     UART1_GET_UART_RX_CTRL_POLARITY(UART1_UART_IRDA_POLARITY)                | \
                     UART1_GET_UART_RX_CTRL_MP_MODE(UART1_UART_MP_MODE_ENABLE)                | \
                     UART1_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(UART1_UART_DROP_ON_PARITY_ERR) | \
                     UART1_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(UART1_UART_DROP_ON_FRAME_ERR)   | \
                     UART1_GET_UART_RX_CTRL_BREAK_WIDTH(UART1_UART_RX_BREAK_WIDTH)            | \
                     UART1_UART_DEFAULT_RX_CTRL_PARITY)


    #define UART1_UART_DEFAULT_RX_CTRL \
                                (UART1_GET_RX_CTRL_DATA_WIDTH(UART1_UART_DATA_BITS_NUM)        | \
                                 UART1_GET_RX_CTRL_MEDIAN    (UART1_UART_MEDIAN_FILTER_ENABLE) | \
                                 UART1_GET_UART_RX_CTRL_ENABLED(UART1_UART_DIRECTION))

    #define UART1_UART_DEFAULT_RX_FIFO_CTRL \
                                UART1_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(UART1_UART_RX_TRIGGER_LEVEL)

    #define UART1_UART_DEFAULT_RX_MATCH_REG  ((0u != UART1_UART_MP_MODE_ENABLE) ?          \
                                (UART1_GET_RX_MATCH_ADDR(UART1_UART_MP_RX_ADDRESS) | \
                                 UART1_GET_RX_MATCH_MASK(UART1_UART_MP_RX_ADDRESS_MASK)) : (0u))

    /* TX direction */
    #define UART1_UART_DEFAULT_TX_CTRL_PARITY (UART1_UART_DEFAULT_RX_CTRL_PARITY)

    #define UART1_UART_DEFAULT_UART_TX_CTRL \
                                (UART1_GET_UART_TX_CTRL_MODE(UART1_UART_STOP_BITS_NUM)       | \
                                 UART1_GET_UART_TX_CTRL_RETRY_NACK(UART1_UART_RETRY_ON_NACK) | \
                                 UART1_UART_DEFAULT_TX_CTRL_PARITY)

    #define UART1_UART_DEFAULT_TX_CTRL \
                                (UART1_GET_TX_CTRL_DATA_WIDTH(UART1_UART_DATA_BITS_NUM) | \
                                 UART1_GET_UART_TX_CTRL_ENABLED(UART1_UART_DIRECTION))

    #define UART1_UART_DEFAULT_TX_FIFO_CTRL \
                                UART1_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(UART1_UART_TX_TRIGGER_LEVEL)

    #define UART1_UART_DEFAULT_FLOW_CTRL \
                        (UART1_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(UART1_UART_RTS_FIFO_LEVEL) | \
                         UART1_GET_UART_FLOW_CTRL_RTS_POLARITY (UART1_UART_RTS_POLARITY)   | \
                         UART1_GET_UART_FLOW_CTRL_CTS_POLARITY (UART1_UART_CTS_POLARITY)   | \
                         UART1_GET_UART_FLOW_CTRL_CTS_ENABLE   (UART1_UART_CTS_ENABLE))

    /* Interrupt sources */
    #define UART1_UART_DEFAULT_INTR_I2C_EC_MASK  (UART1_NO_INTR_SOURCES)
    #define UART1_UART_DEFAULT_INTR_SPI_EC_MASK  (UART1_NO_INTR_SOURCES)
    #define UART1_UART_DEFAULT_INTR_SLAVE_MASK   (UART1_NO_INTR_SOURCES)
    #define UART1_UART_DEFAULT_INTR_MASTER_MASK  (UART1_NO_INTR_SOURCES)
    #define UART1_UART_DEFAULT_INTR_RX_MASK      (UART1_UART_INTR_RX_MASK)
    #define UART1_UART_DEFAULT_INTR_TX_MASK      (UART1_UART_INTR_TX_MASK)

#endif /* (UART1_SCB_MODE_UART_CONST_CFG) */


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

#define UART1_SPIM_ACTIVE_SS0    (UART1_SPI_SLAVE_SELECT0)
#define UART1_SPIM_ACTIVE_SS1    (UART1_SPI_SLAVE_SELECT1)
#define UART1_SPIM_ACTIVE_SS2    (UART1_SPI_SLAVE_SELECT2)
#define UART1_SPIM_ACTIVE_SS3    (UART1_SPI_SLAVE_SELECT3)

#endif /* CY_SCB_SPI_UART_UART1_H */


/* [] END OF FILE */
